BAS BMEKZU Project/src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НКУ_БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслугиАморт</name>
      <description>Быт. усл. (пат.), аморт.</description>
    </items>
    <items>
      <name>БытУслугиАмортНеОблагНДС</name>
      <description>Быт. усл. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>БытУслугиНеОблагНДС</name>
      <description>Быт. усл. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнесАморт</name>
      <description>Игор. бизнес (пат.), аморт.</description>
    </items>
    <items>
      <name>ИгорБизнесАмортНеОблагНДС</name>
      <description>Игор. бизнес (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ИгорБизнесНеОблагНДС</name>
      <description>Игор. бизнес (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НКУ_НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельностьАморт</name>
      <description>Нехоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>НеХозДеятельностьАмортНеОблагНДС</name>
      <description>Нехоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>НеХозДеятельностьНеОблагНДС</name>
      <description>Нехоз. д-сть, не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>НКУ_ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>ОбмВалютыАморт</name>
      <description>Обм. вал. (пат.), аморт.</description>
    </items>
    <items>
      <name>ОбмВалютыАмортНеОблагНДС</name>
      <description>Обм. вал. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалютыНеОблагНДС</name>
      <description>Обм. вал. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Освобожденная</name>
      <description>Освобожд. ( п. 154.6 НКУ)</description>
    </items>
    <items>
      <name>НКУ_ПрограммнаяПродукция</name>
      <description>Прогр. прод. (субъекты индустрии)</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Распределяемая</name>
      <description>Распределяемая</description>
    </items>
    <items>
      <name>НКУ_ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельностьАморт</name>
      <description>Торг. д-сть (пат.), аморт.</description>
    </items>
    <items>
      <name>ТоргДеятельностьАмортНеОблагНДС</name>
      <description>Торг. д-сть (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ТоргДеятельностьНеОблагНДС</name>
      <description>Торг. д-сть (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>НКУ_ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельностьАморт</name>
      <description>Хоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>ХозДеятельностьАмортНеОблагНДС</name>
      <description>Хоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельностьНеОблагНДС</name>
      <description>Хоз. д-сть, не обл. НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНалоговогоНазначения</name>
    <type>
      <types>EnumRef.ГруппыНалоговыхНазначений</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Enums/ГруппыНалоговыхНазначений/ГруппыНалоговыхНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыНалоговыхНазначений</name>
  <enumValues>
    <name>НалоговыеНазначенияДоНКУ</name>
  </enumValues>
  <enumValues>
    <name>НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС</name>
  </enumValues>
  <enumValues>
    <name>НалоговыеНазначенияДоходовИЗатрат</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/Forms/ФормаВыбора/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("ГруппаНалоговогоНазначения", ГруппаНалоговогоНазначения);
	
	Если ЗначениеЗаполнено(ГруппаНалоговогоНазначения) Тогда
	 	// Перобразуем в не отображаемый в настройках формы отбор
		Параметры.Отбор.Удалить("ГруппаНалоговогоНазначения");
		Элементы.ГруппаНалоговогоНазначения.ТолькоПросмотр = Истина;	
		Элементы.ГруппаНалоговогоНазначения.Вид  = ВидПоляФормы.ПолеВвода;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаНалоговогоНазначения", ГруппаНалоговогоНазначения, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
			ГруппаНалоговогоНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока,"ГруппаНалоговогоНазначения");
		Иначе
			ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС;
		КонецЕсли; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаНалоговогоНазначения", ГруппаНалоговогоНазначения, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;

	ПоказыватьВстроеннуюСправкуСохраненноеЗначение	= ХранилищеОбщихНастроек.Загрузить("Справочник_НалоговыеНазначенияАктивовИЗатрат",
		"ПоказыватьВстроеннуюСправку");
	ПоказыватьВстроеннуюСправку	= ?(ПоказыватьВстроеннуюСправкуСохраненноеЗначение = Неопределено,
		Истина, ПоказыватьВстроеннуюСправкуСохраненноеЗначение);
		
	УправлениеФормойСервер();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ГруппаНалоговогоНазначенияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаНалоговогоНазначения", ГруппаНалоговогоНазначения, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(ГруппаНалоговогоНазначения));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьТекстВстроеннойСправки(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказатьСкрытьВстроеннуюСправку(Команда)

	ПоказыватьВстроеннуюСправку = НЕ ПоказыватьВстроеннуюСправку;
	УправлениеФормойСервер();
	ЗаполнитьТекстВстроеннойСправки(Элементы.Список.ТекущиеДанные);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеФормойСервер()
	
	ХранилищеОбщихНастроек.Сохранить("Справочник_НалоговыеНазначенияАктивовИЗатрат", "ПоказыватьВстроеннуюСправку",
		ПоказыватьВстроеннуюСправку);

	Элементы.ВстроеннаяСправка.Видимость = ПоказыватьВстроеннуюСправку;

	Элементы.ФормаПоказатьСкрытьВстроеннуюСправку.Заголовок = ?(ПоказыватьВстроеннуюСправку, НСтр("ru='Скрыть справку';uk='Приховати довідку'"),
		НСтр("ru='Показать справку';uk='Показати довідку'"));
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстВстроеннойСправки(Знач НалоговоеНазначениеСтруктура)
	
	НалоговоеНазначение = НалоговоеНазначениеСтруктура.Ссылка;
	
	Если НЕ ПоказыватьВстроеннуюСправку Тогда
		Возврат;
	КонецЕсли;
	
	Если НалоговоеНазначение <> Неопределено Тогда
		ИмяОбласти = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПолучитьИмяПредопределенного(НалоговоеНазначение);
	Иначе
		ИмяОбласти = "ХозДеятельность";
	КонецЕсли;
	
	МакетПомощника = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПолучитьМакет("Справка");
	ОбластьТекстЗаголовок			= ИмяОбласти + "|Заголовок";
	ОбластьТекстаСправки = МакетПомощника.ПолучитьОбласть(ОбластьТекстЗаголовок);
	ТекстЗаголовок = ОбластьТекстаСправки.ТекущаяОбласть.Текст;
	
	ОбластьТекстОбщий			= ИмяОбласти + "|Общий";
	ОбластьТекстаСправки = МакетПомощника.ПолучитьОбласть(ОбластьТекстОбщий);
	ТекстОбщий = ОбластьТекстаСправки.ТекущаяОбласть.Текст;
	
	ТекстОбщий = "<DIV>" + СтрЗаменить(ТекстОбщий, Символы.ПС, "</DIV>" + Символы.ПС + "<DIV>") + "</DIV>";

 	ТекстВстроеннойСправки = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПолучитьМакет("ШаблонВстроеннойСправки").ПолучитьТекст();

	ТекстВстроеннойСправки = СтрЗаменить(ТекстВстроеннойСправки, "%header%", ТекстЗаголовок);
	ТекстВстроеннойСправки = СтрЗаменить(ТекстВстроеннойСправки, "%text%", ТекстОбщий);

	ВстроеннаяСправка = ТекстВстроеннойСправки;
	
КонецПроцедуры
